---
kind: type
id: T:Autodesk.Revit.DB.CutFailureReason
source: html/3ab731f0-b37a-49b9-0419-b5ca48df783d.htm
---
# Autodesk.Revit.DB.CutFailureReason

The reason why a solid-solid cut cannot be created.

## Syntax (C#)
```csharp
public enum CutFailureReason
```